Revit 2027 API
LineLoad.EndPoint Property
 Returns the three dimensional location of the end point for the line load.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ EndPoint { get; }
Public ReadOnly Property EndPoint As XYZ
	Get
public:
property XYZ^ EndPoint {
	XYZ^ get ();
}
member EndPoint : XYZ with get
Property Value
XYZ
Remarks
 The location of the end point is measured in decimal feet.
See Also
Reference
LineLoad Class
Autodesk.Revit.DB.Structure Namespace